IDENTIFICATION DIVISION.
PROGRAM-ID.  HOGE.
ENVIRONMENT DIVISION.
DATA DIVISION.
WORKING-STORAGE SECTION.
77 X PIC 9(5) OCCURS 100.
77 S PIC X(1) OCCURS 100.
77 n PIC 9(5).
PROCEDURE DIVISION.
  COMPUTE n = 1.
  PERFORM UNTIL n = 5
    ACCEPT S(n)
    DISPLAY S(n)
    DISPLAY n
    COMPUTE n = (n + 1)
  END-PERFORM.
  STOP RUN.
  


IDENTIFICATION DIVISION.
PROGRAM-ID.  HOGE.
ENVIRONMENT DIVISION.
DATA DIVISION.
WORKING-STORAGE SECTION.
77 X PIC Z9.
PROCEDURE DIVISION.
  ACCEPT n
  DISPLAY n
  STOP RUN.
  
